<?php

$arr = [['name' => 'city_1', 'Y' => '1876', 'P' => '4654', 'NF' => '8', 'SH' => '36', 'CA' => '49', 'YI' => '7000'],
       ['name' => 'city_2', 'Y' => '1900', 'P' => '3690', 'NF' => '8', 'SH' => '54', 'CA' => '32', 'YI' => '8676'],
       ['name' => 'city_3', 'Y' => '1765', 'P' => '5432', 'NF' => '13', 'SH' => '29', 'CA' => '39', 'YI' => '1000'],
       ['name' => 'city_4', 'Y' => '1920', 'P' => '4524', 'NF' =>'7', 'SH' => '19', 'CA' => '10', 'YI' => '9000'],
       ['name' => 'city_5', 'Y' => '1834', 'P' => '3500', 'NF' => '10', 'SH' => '13', 'CA' => '10', 'YI' => '10500'],
      ];


$count = count($arr);

$tig_1 = (((($arr[0]['NF'] +$arr[0]['SH'])/$arr[0]['CA'])*100)*$arr[0]['P']/$arr[0]['CA'])*(2019 - $arr[0]['Y']);
$tig_2 = (((($arr[1]['NF'] +$arr[1]['SH'])/$arr[1]['CA'])*100)*$arr[1]['P']/$arr[1]['CA'])*(2019 - $arr[1]['Y']);
$tig_3 = (((($arr[2]['NF'] +$arr[2]['SH'])/$arr[2]['CA'])*100)*$arr[2]['P']/$arr[2]['CA'])*(2019 - $arr[2]['Y']);
$tig_4 = (((($arr[3]['NF'] +$arr[3]['SH'])/$arr[3]['CA'])*100)*$arr[3]['P']/$arr[3]['CA'])*(2019 - $arr[3]['Y']);
$tig_5 = (((($arr[4]['NF'] +$arr[4]['SH'])/$arr[4]['CA'])*100)*$arr[4]['P']/$arr[4]['CA'])*(2019 - $arr[4]['Y']);

echo '<ul>
   <li>' . $arr[0]['name'] . ': ' . $tig_1 . '</li>'.
   '<li>' . $arr[1]['name'] . ': ' . $tig_2 . '</li>'.
   '<li>' . $arr[2]['name'] . ': ' . $tig_3 . '</li>'.
   '<li>' . $arr[3]['name'] . ': ' . $tig_4 . '</li>'.  
   '<li>' . $arr[4]['name'] . ': ' . $tig_5 . '</li>'.
   '</ul>';

   $avg = ($tig_1 + $tig_2 + $tig_3 + $tig_4 + $tig_5) / 5;

   echo 'Averge TIG:' . $avg;

   echo '<table border = "1">
     <tr>
     <td></td>
     <td>година на основане</td>
     <td>население</td>
     <td>брой предприятия</td>
     <td>брой спортни зали</td>
     <td>брой културни мероприятия годишно</td>
     <td>годишен приход на глава от население</td>
     </tr>';


     for ($i=0; $i < $count; $i++) { 
     	echo '<tr>';
     	foreach ($arr[$i] as $value) {
       echo '<td>'.$value.'</td>';
         }
      echo '</tr>';
    }
    echo '</table>';
    



